phamleanh05/VXL-1652026-Assignment/stm32RBT/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUTTON_PERD_Pin GPIO_PIN_0
#define BUTTON_PERD_GPIO_Port GPIOA
#define RED_PERD_Pin GPIO_PIN_4
#define RED_PERD_GPIO_Port GPIOA
#define GREEN_PERD_Pin GPIO_PIN_5
#define GREEN_PERD_GPIO_Port GPIOA
#define RED_LED1_Pin GPIO_PIN_7
#define RED_LED1_GPIO_Port GPIOA
#define AMBER_LED1_Pin GPIO_PIN_8
#define AMBER_LED1_GPIO_Port GPIOA
#define GREEN_LED1_Pin GPIO_PIN_9
#define GREEN_LED1_GPIO_Port GPIOA
#define RED_LED2_Pin GPIO_PIN_10
#define RED_LED2_GPIO_Port GPIOA
#define AMBER_LED2_Pin GPIO_PIN_11
#define AMBER_LED2_GPIO_Port GPIOA
#define GREEN_LED2_Pin GPIO_PIN_12
#define GREEN_LED2_GPIO_Port GPIOA
#define BUTTON1_Pin GPIO_PIN_10
#define BUTTON1_GPIO_Port GPIOC
#define BUTTON2_Pin GPIO_PIN_11
#define BUTTON2_GPIO_Port GPIOC
#define BUTTON3_Pin GPIO_PIN_12
#define BUTTON3_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
